{
  "nav": {
    "about": "About Me",
    "work": "Work Experience",
    "skill": "Technical Skills",
    "contact": "Contact Me"
  },
  "resume": "Resume",
  "header": {
    "name": "Febe Huang",
    "title": "Junior Frontend Engineer | Focused on UX and Team Collaboration",
    "greeting": "Hello, I'm Febe Huang, a Frontend Engineer specializing in Vue.js and Nuxt to develop high-performance websites with excellent user experience. \n I possess experience in front-end/back-end integration, prioritize code quality, performance optimization, and interface details, and continuously refine my skills to take on complete product development challenges."
  },
  "link": {
    "view_work": "View Projects",
    "contact": "Contact Me",
    "view_github": "View on GitHub",
    "view_project": "Visit Website"
  },
  "sections": {
    "featured_projects": "Featured Projects",
    "featured_desc": "Full-Stack Development & Dynamic Interface Design",
    "technical_skills_desc": "Core technical tools I frequently use in practical development",
    "technical_skills": "Technical Skills",
    "work": "Work Experience",
    "work_desc": "Practical Frontend Engineering & Optimization Experience",
    "about_me": "About Me",
    "get_in_touch": "Contact Information",
    "get_in_touch_desc": "Feel free to contact me through the methods below. I look forward to potential collaboration opportunities!"
  },
  "softskill": {
    "softskill_title": "Soft Skills",
    "softskill_desc": "Possess excellent teamwork, proactive learning, and problem-solving abilities, along with effective stress management and time organization skills.",
    "title_1": "Communication and Collaboration",
    "desc_1": "Participated in large-scale system development projects (backend systems and frontend modules) during my internships, collaborating across departments (Frontend, Backend, Design, PM) to cultivate strong communication and requirements understanding skills.",
    "title_2": "Proactive Learning and Growth",
    "desc_2": "Upon returning to Taiwan, I independently pursued further training in Vue 3, Nuxt 3, Tailwind CSS, and interactive animation (GSAP), demonstrating the ability to proactively learn and apply new skills to real projects.",
    "title_3": "Problem Solving and Resilience",
    "desc_3": "Developed strong resilience and problem-solving skills in high-pressure environments, such as tight project deadlines and high-intensity overseas work, ensuring stable task completion even under multi-tasking conditions.",
    "title_4": "Time Management",
    "desc_4": "Able to balance project development, technical study, and work scheduling effectively, ensuring timely progress without delays."
  },
  "skills": {
    "frontend_title": "Frontend",
    "frontend_desc": "Primarily uses Vue 3 and Nuxt as core development frameworks; familiar with component-based development, state management, and frontend interactive animations.",
    "backend_title": "Backend",
    "backend_desc": "Possesses fundamental backend development experience with Node.js and Express, capable of API integration and basic CRUD operations."
  },
  "experience": {
    "date_1": "2024/2 - 2024/6",
    "date_2": "2022/2 - 2022/6",
    "company_1": "Cathay Life Insurance Co., Ltd.",
    "role_1": "Frontend Intern",
    "desc_1": "Responsible for frontend slicing, API integration, and backend system feature development. \n\n ▪️Successfully transformed 8 static HTML pages into a dynamic Vue 2 framework within 20 days. \n \n ▪️Integrated multiple backend APIs, completing data presentation and interactive functionalities. \n\n ▪️Project successfully launched and utilized by actual users.",
    "company_2": "Tyr Technology Co., Ltd.",
    "role_2": "Frontend Intern",
    "desc_2": "Involved in developing multiple backend system features and optimizing core module performance.\n\n ▪️Independently or collaboratively completed the interface and function implementation for multiple website backend management pages, supporting the business team's daily operations. \n\n ▪️Successfully researched and implemented a frontend drag-and-drop component library, and by optimizing the structure of 3 key modules, significantly improved the rendering speed of highly complex pages, enhancing operational efficiency and user experience. \n\n ▪️Actively participated in functional module architecture discussions, gaining experience in component reusability and code standardization."
  },
  "projects": {
    "project_1_title": "NewZealand Travel | Personal Travel Content Website | 2025",
    "project_1_desc": "A travel-themed informational website focusing on New Zealand, offering tourist spot introductions, itinerary planning, and travel information integration.\n The project uses Nuxt 3 and Tailwind CSS for construction, paired with GSAP for animation effects to enhance interactive experience and visual fluidity. \n Additionally, the site features a chatbot that can answer users’ travel questions in real time and provide personalized itinerary suggestions, making trip planning more convenient and engaging.",
    "project_2_title": "GarboGo | Real-Time Garbage Bin Reporting System | 2023",
    "project_2_desc": "A full-stack project combining waste classification and map search functionalities.\n Node.js and Express were used to build the backend API, MongoDB served as the database, and the Google Maps API was integrated for location querying.\n The frontend was responsible for interface design and data integration, implementing full CRUD functionality."
  },
  "about": {
    "about_me": "About Me",
    "title": "Junior Frontend Engineer",
    "education_title": "Education",
    "education_desc": "Department of Information Management",
    "school": "National Taichung University of Science and Technology",
    "graduated": "Graduation Time: 2024",
    "des": "I am a Junior Frontend Engineer primarily focused on Vue / Nuxt, with practical internship and project experience. I am proficient in everything from design mockup slicing, API integration, interactive animations, to deployment processes.\n\nAfter graduation, I spent a year on a Working Holiday in Australia, engaging in service and teamwork-related jobs, which helped me develop strong communication, stress management, and time organization skills. This experience solidified my desire to return to the tech industry and continue to specialize in the frontend domain.\n\nUpon returning to Taiwan, I refreshed my technical foundation, focusing on Vue 3, Nuxt 3, Tailwind CSS, and interactive animation (GSAP). I have independently completed multiple projects, continuously optimizing code structure, performance, and user experience. I aspire to be a Frontend Engineer who can collaborate seamlessly with designers and backend developers. \n\n I look forward to joining a frontend team that values growth and practical implementation, where I can continuously deepen my technical expertise through projects and gradually take on the responsibility of independent feature module development."
  }
}